###  Results for `terraform apply -auto-approve` on `dev/vpc` 

<details>
<summary>Show output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.vpc_eip_1a will be created
  + resource "aws_eip" "vpc_eip_1a" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "arq-EKS-epi-1a"
        }
      + tags_all             = {
          + "Name" = "arq-EKS-epi-1a"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.vpc_eip_1b will be created
  + resource "aws_eip" "vpc_eip_1b" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "arq-EKS-epi-1b"
        }
      + tags_all             = {
          + "Name" = "arq-EKS-epi-1b"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.vpc_eip_1c will be created
  + resource "aws_eip" "vpc_eip_1c" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "arq-EKS-epi-1c"
        }
      + tags_all             = {
          + "Name" = "arq-EKS-epi-1c"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "arq-EKS-igw"
        }
      + tags_all = {
          + "Name" = "arq-EKS-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.nat_1a will be created
  + resource "aws_nat_gateway" "nat_1a" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "arq-EKS-nat-1a"
        }
      + tags_all                           = {
          + "Name" = "arq-EKS-nat-1a"
        }
    }

  # aws_nat_gateway.nat_1b will be created
  + resource "aws_nat_gateway" "nat_1b" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "arq-EKS-nat-1b"
        }
      + tags_all                           = {
          + "Name" = "arq-EKS-nat-1b"
        }
    }

  # aws_nat_gateway.nat_1c will be created
  + resource "aws_nat_gateway" "nat_1c" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "arq-EKS-nat-1c"
        }
      + tags_all                           = {
          + "Name" = "arq-EKS-nat-1c"
        }
    }

  # aws_route.private_access_1a will be created
  + resource "aws_route" "private_access_1a" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_access_1b will be created
  + resource "aws_route" "private_access_1b" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_access_1c will be created
  + resource "aws_route" "private_access_1c" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_access will be created
  + resource "aws_route" "public_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private_internet_access_1a will be created
  + resource "aws_route_table" "private_internet_access_1a" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "arq-EKS-private-1a"
        }
      + tags_all         = {
          + "Name" = "arq-EKS-private-1a"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private_internet_access_1b will be created
  + resource "aws_route_table" "private_internet_access_1b" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "arq-EKS-private-1b"
        }
      + tags_all         = {
          + "Name" = "arq-EKS-private-1b"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private_internet_access_1c will be created
  + resource "aws_route_table" "private_internet_access_1c" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "arq-EKS-private-1c"
        }
      + tags_all         = {
          + "Name" = "arq-EKS-private-1c"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_internet_access will be created
  + resource "aws_route_table" "public_internet_access" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "arq-EKS-public"
        }
      + tags_all         = {
          + "Name" = "arq-EKS-public"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private_1a will be created
  + resource "aws_route_table_association" "private_1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_1b will be created
  + resource "aws_route_table_association" "private_1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_1c will be created
  + resource "aws_route_table_association" "private_1c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_1a will be created
  + resource "aws_route_table_association" "public_1a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_1b will be created
  + resource "aws_route_table_association" "public_1b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_1c will be created
  + resource "aws_route_table_association" "public_1c" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_ssm_parameter.databases_1a will be created
  + resource "aws_ssm_parameter" "databases_1a" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arq-EKS/vpc/subnet_databases_1a"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.databases_1b will be created
  + resource "aws_ssm_parameter" "databases_1b" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arq-EKS/vpc/subnet_databases_1b"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.databases_1c will be created
  + resource "aws_ssm_parameter" "databases_1c" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arq-EKS/vpc/subnet_databases_1c"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.private_1a will be created
  + resource "aws_ssm_parameter" "private_1a" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arq-EKS/vpc/subnet_private_1a"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.private_1b will be created
  + resource "aws_ssm_parameter" "private_1b" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arq-EKS/vpc/subnet_private_1b"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.private_1c will be created
  + resource "aws_ssm_parameter" "private_1c" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arq-EKS/vpc/subnet_private_1c"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.public_1a will be created
  + resource "aws_ssm_parameter" "public_1a" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arq-EKS/vpc/subnet_public_1a"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.public_1b will be created
  + resource "aws_ssm_parameter" "public_1b" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arq-EKS/vpc/subnet_public_1b"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.public_1c will be created
  + resource "aws_ssm_parameter" "public_1c" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arq-EKS/vpc/subnet_public_1c"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.vpc will be created
  + resource "aws_ssm_parameter" "vpc" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/arq-EKS/vpc/vpc_id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_subnet.databases_subnet_1a will be created
  + resource "aws_subnet" "databases_subnet_1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.51.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "arq-EKS-databases-subnet-1a"
        }
      + tags_all                                       = {
          + "Name" = "arq-EKS-databases-subnet-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.databases_subnet_1b will be created
  + resource "aws_subnet" "databases_subnet_1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.52.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "arq-EKS-databases-subnet-1b"
        }
      + tags_all                                       = {
          + "Name" = "arq-EKS-databases-subnet-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.databases_subnet_1c will be created
  + resource "aws_subnet" "databases_subnet_1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.53.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "arq-EKS-databases-subnet-1c"
        }
      + tags_all                                       = {
          + "Name" = "arq-EKS-databases-subnet-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnet_1a will be created
  + resource "aws_subnet" "private_subnet_1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "arq-EKS-private-subnet-1a"
        }
      + tags_all                                       = {
          + "Name" = "arq-EKS-private-subnet-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnet_1b will be created
  + resource "aws_subnet" "private_subnet_1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "arq-EKS-private-subnet-1b"
        }
      + tags_all                                       = {
          + "Name" = "arq-EKS-private-subnet-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnet_1c will be created
  + resource "aws_subnet" "private_subnet_1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "arq-EKS-private-subnet-1c"
        }
      + tags_all                                       = {
          + "Name" = "arq-EKS-private-subnet-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet_1a will be created
  + resource "aws_subnet" "public_subnet_1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "arq-EKS-public-subnet-1a"
        }
      + tags_all                                       = {
          + "Name" = "arq-EKS-public-subnet-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet_1b will be created
  + resource "aws_subnet" "public_subnet_1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.49.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "arq-EKS-public-subnet-1b"
        }
      + tags_all                                       = {
          + "Name" = "arq-EKS-public-subnet-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet_1c will be created
  + resource "aws_subnet" "public_subnet_1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.50.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "arq-EKS-public-subnet-1c"
        }
      + tags_all                                       = {
          + "Name" = "arq-EKS-public-subnet-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "arq-EKS"
        }
      + tags_all                             = {
          + "Name" = "arq-EKS"
        }
    }

Plan: 41 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ssm_subnet_databases_1a = (sensitive value)
  + ssm_subnet_databases_1b = (sensitive value)
  + ssm_subnet_databases_1c = (sensitive value)
  + ssm_subnet_private_1a   = (sensitive value)
  + ssm_subnet_private_1b   = (sensitive value)
  + ssm_subnet_private_1c   = (sensitive value)
  + ssm_subnet_public_1a    = (sensitive value)
  + ssm_subnet_public_1b    = (sensitive value)
  + ssm_subnet_public_1c    = (sensitive value)
  + ssm_vpc_id              = (sensitive value)
aws_eip.vpc_eip_1c: Creating...
aws_vpc.main: Creating...
aws_eip.vpc_eip_1b: Creating...
aws_eip.vpc_eip_1a: Creating...
aws_eip.vpc_eip_1a: Creation complete after 0s [id=eipalloc-027f51dd8e7901591]
aws_eip.vpc_eip_1b: Creation complete after 0s [id=eipalloc-07e1730e063ea4b52]
aws_eip.vpc_eip_1c: Creation complete after 0s [id=eipalloc-081a879bd84d5a678]
aws_vpc.main: Still creating... [10s elapsed]
aws_vpc.main: Creation complete after 11s [id=vpc-023eb259c34f863b2]
aws_ssm_parameter.vpc: Creating...
aws_subnet.public_subnet_1c: Creating...
aws_subnet.private_subnet_1a: Creating...
aws_subnet.databases_subnet_1b: Creating...
aws_subnet.private_subnet_1c: Creating...
aws_internet_gateway.gw: Creating...
aws_subnet.public_subnet_1b: Creating...
aws_subnet.databases_subnet_1a: Creating...
aws_subnet.databases_subnet_1c: Creating...
aws_route_table.private_internet_access_1a: Creating...
aws_ssm_parameter.vpc: Creation complete after 0s [id=/arq-EKS/vpc/vpc_id]
aws_route_table.private_internet_access_1b: Creating...
aws_route_table.private_internet_access_1a: Creation complete after 1s [id=rtb-0e456a48843b94dc0]
aws_subnet.public_subnet_1a: Creating...
aws_subnet.public_subnet_1c: Creation complete after 1s [id=subnet-0d5a73324770591a3]
aws_subnet.private_subnet_1b: Creating...
aws_subnet.databases_subnet_1c: Creation complete after 1s [id=subnet-08617935026cbb5c3]
aws_route_table.private_internet_access_1c: Creating...
aws_internet_gateway.gw: Creation complete after 1s [id=igw-068263a841ecdb06e]
aws_route_table.public_internet_access: Creating...
aws_subnet.databases_subnet_1a: Creation complete after 1s [id=subnet-0423c7960582630ec]
aws_nat_gateway.nat_1c: Creating...
aws_subnet.private_subnet_1a: Creation complete after 1s [id=subnet-04a1558e7397aaef1]
aws_subnet.private_subnet_1c: Creation complete after 1s [id=subnet-0bceca0ce56a23575]
aws_ssm_parameter.databases_1c: Creating...
aws_ssm_parameter.public_1c: Creating...
aws_subnet.public_subnet_1b: Creation complete after 1s [id=subnet-083d32b3652e32a45]
aws_ssm_parameter.databases_1a: Creating...
aws_subnet.databases_subnet_1b: Creation complete after 1s [id=subnet-04e3cba03bfde594a]
aws_ssm_parameter.private_1a: Creating...
aws_route_table.private_internet_access_1b: Creation complete after 1s [id=rtb-0a2ca0e4f18847326]
aws_route_table_association.private_1a: Creating...
aws_ssm_parameter.public_1c: Creation complete after 0s [id=/arq-EKS/vpc/subnet_public_1c]
aws_ssm_parameter.private_1c: Creating...
aws_ssm_parameter.databases_1a: Creation complete after 0s [id=/arq-EKS/vpc/subnet_databases_1a]
aws_ssm_parameter.databases_1c: Creation complete after 0s [id=/arq-EKS/vpc/subnet_databases_1c]
aws_ssm_parameter.public_1b: Creating...
aws_nat_gateway.nat_1b: Creating...
aws_ssm_parameter.private_1a: Creation complete after 0s [id=/arq-EKS/vpc/subnet_private_1a]
aws_ssm_parameter.databases_1b: Creating...
aws_ssm_parameter.private_1c: Creation complete after 0s [id=/arq-EKS/vpc/subnet_private_1c]
aws_ssm_parameter.public_1b: Creation complete after 0s [id=/arq-EKS/vpc/subnet_public_1b]
aws_ssm_parameter.databases_1b: Creation complete after 0s [id=/arq-EKS/vpc/subnet_databases_1b]
aws_subnet.public_subnet_1a: Creation complete after 0s [id=subnet-00bd8c623095c0227]
aws_ssm_parameter.public_1a: Creating...
aws_route_table.public_internet_access: Creation complete after 0s [id=rtb-0fa2f7191b265366c]
aws_nat_gateway.nat_1a: Creating...
aws_route.public_access: Creating...
aws_route_table_association.public_1c: Creating...
aws_route_table_association.public_1a: Creating...
aws_route_table_association.private_1a: Creation complete after 0s [id=rtbassoc-02257a543ecdb2fd8]
aws_route_table_association.public_1b: Creating...
aws_route_table.private_internet_access_1c: Creation complete after 0s [id=rtb-0c90cc035e6045151]
aws_route_table_association.private_1c: Creating...
aws_subnet.private_subnet_1b: Creation complete after 0s [id=subnet-0c5dd6495eaa098be]
aws_ssm_parameter.private_1b: Creating...
aws_ssm_parameter.public_1a: Creation complete after 0s [id=/arq-EKS/vpc/subnet_public_1a]
aws_route_table_association.private_1b: Creating...
aws_ssm_parameter.private_1b: Creation complete after 0s [id=/arq-EKS/vpc/subnet_private_1b]
aws_route_table_association.public_1b: Creation complete after 0s [id=rtbassoc-0e452ed740f1440ef]
aws_route_table_association.public_1c: Creation complete after 0s [id=rtbassoc-03bf67eceb68c6975]
aws_route_table_association.private_1b: Creation complete after 0s [id=rtbassoc-00330d67a53a72f41]
aws_route.public_access: Creation complete after 1s [id=r-rtb-0fa2f7191b265366c1080289494]
aws_route_table_association.private_1c: Creation complete after 1s [id=rtbassoc-0dc33138327ecbac0]
aws_route_table_association.public_1a: Creation complete after 1s [id=rtbassoc-0f41e41da0dc0ca30]
aws_nat_gateway.nat_1c: Still creating... [10s elapsed]
aws_nat_gateway.nat_1b: Still creating... [10s elapsed]
aws_nat_gateway.nat_1a: Still creating... [10s elapsed]
aws_nat_gateway.nat_1c: Still creating... [20s elapsed]
aws_nat_gateway.nat_1b: Still creating... [20s elapsed]
aws_nat_gateway.nat_1a: Still creating... [20s elapsed]
aws_nat_gateway.nat_1c: Still creating... [30s elapsed]
aws_nat_gateway.nat_1b: Still creating... [30s elapsed]
aws_nat_gateway.nat_1a: Still creating... [30s elapsed]
aws_nat_gateway.nat_1c: Still creating... [40s elapsed]
aws_nat_gateway.nat_1b: Still creating... [40s elapsed]
aws_nat_gateway.nat_1a: Still creating... [40s elapsed]
aws_nat_gateway.nat_1c: Still creating... [50s elapsed]
aws_nat_gateway.nat_1b: Still creating... [50s elapsed]
aws_nat_gateway.nat_1a: Still creating... [50s elapsed]
aws_nat_gateway.nat_1c: Still creating... [1m0s elapsed]
aws_nat_gateway.nat_1b: Still creating... [1m0s elapsed]
aws_nat_gateway.nat_1a: Still creating... [1m0s elapsed]
aws_nat_gateway.nat_1c: Still creating... [1m10s elapsed]
aws_nat_gateway.nat_1b: Still creating... [1m10s elapsed]
aws_nat_gateway.nat_1a: Still creating... [1m10s elapsed]
aws_nat_gateway.nat_1c: Still creating... [1m20s elapsed]
aws_nat_gateway.nat_1b: Still creating... [1m20s elapsed]
aws_nat_gateway.nat_1a: Still creating... [1m20s elapsed]
aws_nat_gateway.nat_1a: Creation complete after 1m24s [id=nat-05e8b03ee9f7ce2ad]
aws_route.private_access_1a: Creating...
aws_route.private_access_1a: Creation complete after 0s [id=r-rtb-0e456a48843b94dc01080289494]
aws_nat_gateway.nat_1c: Still creating... [1m30s elapsed]
aws_nat_gateway.nat_1b: Still creating... [1m30s elapsed]
aws_nat_gateway.nat_1c: Creation complete after 1m33s [id=nat-0b2b15c0cb91c2e11]
aws_route.private_access_1c: Creating...
aws_route.private_access_1c: Creation complete after 1s [id=r-rtb-0c90cc035e60451511080289494]
aws_nat_gateway.nat_1b: Still creating... [1m40s elapsed]
aws_nat_gateway.nat_1b: Creation complete after 1m44s [id=nat-002cc14f3b258e415]
aws_route.private_access_1b: Creating...
aws_route.private_access_1b: Creation complete after 0s [id=r-rtb-0a2ca0e4f188473261080289494]

Apply complete! Resources: 41 added, 0 changed, 0 destroyed.

Outputs:

ssm_subnet_databases_1a = <sensitive>
ssm_subnet_databases_1b = <sensitive>
ssm_subnet_databases_1c = <sensitive>
ssm_subnet_private_1a = <sensitive>
ssm_subnet_private_1b = <sensitive>
ssm_subnet_private_1c = <sensitive>
ssm_subnet_public_1a = <sensitive>
ssm_subnet_public_1b = <sensitive>
ssm_subnet_public_1c = <sensitive>
ssm_vpc_id = <sensitive>
```

</details>